Revit 2027 API
ScheduleField.GetCombinedParameters Method
 Gets this field's combine parameter array if applicable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<TableCellCombinedParameterData> GetCombinedParameters()
Public Function GetCombinedParameters As IList(Of TableCellCombinedParameterData)
public:
IList<TableCellCombinedParameterData^>^ GetCombinedParameters()
member GetCombinedParameters : unit -> IList<TableCellCombinedParameterData>
Return Value
IList<TableCellCombinedParameterData>
 Gets array of TableCellCombinedParameterData with the combined parameters data
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace